import random

questions = {
    "light": [
        "ما أكثر موقف محرج بسيط حدث لك؟",
        "هل خجلت من نفسك يوماً؟",
        "هل قلت رأياً وندمت عليه؟",
        "هل كذبت كذبة صغيرة اليوم؟",
        "ما سر صغير لم تخبر به أحد؟"
    ],
    "medium": [
        "هل أحببت شخصاً سراً؟",
        "هل غرت من صديق مقرب؟",
        "هل ندمت على علاقة؟",
        "هل كسرت قلب أحد؟",
        "هل لديك إعجاب سري الآن؟"
    ],
    "strong": [
        "هل أخفيت مشاعرك طويلاً؟",
        "هل تمنيت عودة شخص خرج من حياتك؟",
        "هل ضحيت بكرامتك من أجل علاقة؟",
        "هل كنت الخيار الثاني لأحد؟",
        "هل خنت ثقة شخص قريب؟"
    ]
}

def get_random_question(level):
    return random.choice(questions[level])